<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Critter stdlib cheatsheet</title>
<meta name="viewport" content="width=device-width,initial-scale=1">
<link rel="stylesheet" href="style.css">
</head>
<body>

<section>
    <h1>Basics</h1>
    <p>These library functions are imported by default.</p>

    <h2>Arithmetic</h2>

    <div data-critter-lang>
        +(1 2) := 3     ; add
        -(5) := -5      ; negate
        -(5 3) := 2     ; subtract
        *(2 3) := 6     ; multiply
        /(10) := 0.1    ; reciprocal
        /(6 2) := 3     ; divide
        div(5 2) := 2   ; integer division
        mod(5 2) := 1   ; modulo
        ++(2) := 3      ; increment
        --(2) := 1      ; decrement
        abs(-5) := 5    ; absolute value
        max(2 3) := 3   ; maximum
        min(2 3) := 2   ; minimum
        **(2 3) := 8    ; exponent
        exp(1.234 11) := 123400000000   ; scientific notation
    </div>

    <h2>Conditionals</h2>

    <div data-critter-lang>
        value               ; truthy value
        [#ok value]         ; truthy value
        [#error value]      ; falsy value

        ; comparison functions work with and unwrap [#ok value] records
        ; x(T a T b) => x(a b) or x([#ok a] b) or x(a [#ok b]) or x([#ok a] [#ok b])

        ; equality
        =(T a T a) := [#ok a]
        =(a a) := [#ok a]   ; also matches [#error a] [#error a] as [#ok [#error a]]
        =(_ _) := [#error #no-match]

        ; comparison
        <(T Number a T Number b) := [#ok b] :- a < b
        <(_ _) := [#error #no-match]

        and(T a T b) := [#ok b]
        and(_ _) := [#error #no-match]

        ; left-propagating "and"
        also(T a T b) := [#ok a]
        also(_ _) := [#error #no-match]

        or(T a _) := [#ok a]
        or([#error a] T b) := [#ok b]
        or(_ _) := [#error #no-match]

        ; if-then-else
        <(a 3).then({ a + 1 }).else({ 10 })

        ; continue, flatmap, monadic bind
        then(T a {(a) T b}) := [#ok b]
        then([#error b] _) := [#error b]

        ; handle error
        catch(T a _) := [#ok a]
        catch([#error a] {(a) T b}) := [#ok b]

        ; handle error &amp; unwrap
        else(T a _) := a
        else([#error a] {(a)  b}) := b

        ; pattern matching
        let cell := [x: 2 y: 3 state: #alive]
        let next-state := [cell:state cell.neighbors].match([
            {(#alive 2) #alive }
            {(_      3) #alive }
        ]).else({ #dead })
    </div>

    <h2>Records</h2>

    <div data-critter-lang>
        [1 2 3]         ; positional fields
        [foo: 1 bar: 2] ; named fields
        [1 2 foo: 3]    ; mix

        ; does not compile: [foo: 1 2 3]
        ; positional fields must come before named fields

        ; destructuring
        let [a b foo: c] := [1 2 foo: 3]

        ; static field access
        [foo: 1 bar: 2]:foo := 1

        ; crashes
        [foo: 1 bar: 2]:baz

        ; dynamic field access
        [foo: 1 bar: 2].get(#foo) := [:ok 1]
        [foo: 1 bar: 2].get(#baz) := [:error :nil]


    </div>

    <h2>Tables &amp; Databases</h2>

    <div data-critter-lang>
        ; create table
        let foo := table([
            [a: 1 b: 2 c: 3]
            [a: 1 b: 6 c: 5]
            [a: 2 b: 3 c: 4]
        ])

        ; datalog-ish query
        foo.query(
            find: [$b $c]
            where: [[$id [#a] 1]
                    {<(?b ?c)}
                    [$id [#b] $b]
                    [$id [#c] $c]])

        ; filters
        foo.filter({(a: a) >(a 1) })

        ; using call shorthand
        foo.filter(..get(#a).>(1))
        foo.filter(..where([a: 1]))


        ; mapping
        foo.map(..update(#a ++)) := table([

        ])


    </div>

    <h2>Records</h2>

    <div data-critter-lang>
        @let foo := [#a #b #c key: #value]
        ; static field access
        foo:0 := #a         ; access by index
        foo:key := #value   ; access by keyword

        ; dynamic field access
        get(foo 1) := [#ok #b]
        get(foo #key) := [#ok #value]
        get(foo #nope) := #nil

        ; destructuring
        @let [a b c] := foo             ; a = #a, b = #b, c = #c
        @let [a b c key: d] := foo      ; as above and d = #value
        @let [a b c ::key] := foo       ; shorthand for `key: key`


        ; updaters (returns a new record, does not mutate)
        set(foo 2 #different) := [#a #b #different key: #value]
        set(foo #key #different) := [#a #b #c key: #different]

        ; adding new values
        set(foo 3 #d) := [#a #b #c #d key: #different]
        set(foo 4 #e) := [#a #b #c #nil #e key: #different]
        set(foo #different-key #different) := [#a #b #c key: #different different-key: #different]

        ; convert to table
        list(foo) := table[
            [key: 0 value: #a]
            [key: 1 value: #b]
            [key: 2 value: #c]
            [key: #key value: #value]
        ]
    </div>

    <h2>Functions</h2>

    <div data-critter-lang>
        @let foo := { 3 }                       ; function takes no args, returns 3
        @let bar := {(x) +(x 1) }               ; function takes arg x, returns x + 1
        @let baz := {(x y kw: z) x.+(y).-(z) }  ; keyword arguments
        {(x y ::z) x.+(y).-(z)}                 ; keyword shortand, as in destructuring

        foo()       ; call foo with no arguments
        bar(value)  ; call bar with value
        value.bar   ; call bar with value
        value.bar() ; empty parens are OK but not necessary

        baz(1 2 kw: 3)  ; call baz
        1.baz(2 kw: 3)  ; call baz

        ; constructor shorthand
        @let quux := {(record) record:0}
        quux([#a #b #c]) := #a
        quux[#a #b #c] := #a

        ; application
        bar.apply([3]) := 4
        @let b = apply(bar)
        b[3] := 4
        ; variadic functions
        quux.unapply(#a #b #c) := #a
        @let q := unapply(quux)
        q(#a #b #c) := #a
    </div>

    <h2>Tables</h2>

    <div data-critter-lang>
        ; basic literal
        @let foo := table[
            [id: 1 name: "Alice"]
            [id: 2 name: "Bob"]
            [id: 3 name: "Carol"]
        ]
        ; with column labels
        table(
            [#id #name] [
            [1 "Alice"]
            [2 "Bob"]
            [3 "Carol"]
        ])
        ; relational-ish operations
        foo.select[#name]
        foo.where({(r) r:id.=(2) })

        ; set operations
        ; set[] and or xor

        ; combining tables into a database
        ; datalog-ish stuff

    </div>

</section>

<section>
    <h1>Math</h1>

    <div data-critter-lang>
        @import #math

        ; real->integer
        math:round(Number) := Number
        math:floor(Number) := Number
        math:floor(Number) := Number
        math:ceil(Number)  := Number
        math:trunc(Number) := Number

        ; get closest value to number in min/max range
        math:clamp(Number min: Number max: Number) := Number

        ; collections of numbers
        math:sum([Number]) := Number
        math:product([Number]) := Number
        math:mean([Number]) := Number
        math:median([Number]) := Number
        math:extent([Number]) := [min: Number max: Number]

        ; logarithms
        ; TODO: e log10 log2 log

        ; trigonometry
        ; TODO: pi sin cos tan etc...

        ; convert unit to "standard angles" (radians)
        math:degrees(Number) := Number
        math:radians(Number) := Number
        math:turns(Number) := Number

        ; convert to other angle types
        math:->degrees(Number) := Number
        math:->radians(Number) := Number
        math:->turns(Number) := Number

        ; usage
        90.degrees.->turns ; 0.25

        ; coordinates
        math:->cartesian([r: Number t: Number]) := [x: Number y: Number]
        math:->polar([x: Number y: Number]) := [r: Number t: Number]

        ; some matrix math stuff?
    </div>
</section>

<section>
    <h1>Bits</h1>

    <div data-critter-lang>
        @import #bits
        and or xor not << >> >>>

        ; get bit value at index (where index 0 = least-significant bit)
        bits:get(201 3) := 1

        bits:->number([Number]) := Number ; make a number from bits
        ; usage
        bits:->number([1 1 0 0 1 0 0 1]) ; => 201
    </div>
</section>



<script type="text/javascript" src="highlighter.js"></script>

</body>
</html>
